const { getIntersection } = require('../src/index');

describe("Тестирование getIntersection", () => {
	it("C 2 массивами", () => {
		const result = getIntersection(
			[1, 2, 3, 4, 5, 6],
			[4, 5, 6, 7, 8, 9, 10, 11]
		);

		expect(result).toEqual([4, 5, 6]);
	});

	it("C 3 массивами", () => {
		const result = getIntersection(
			[3, 6, 7, 6, 2, 8, 3, 2, 9, 3],
			[8, 9, 5, 2, 9, 4, 0, 9, 6, 6],
			[0, 3, 6, 5, 9, 3, 1, 2]
		);
		expect(result).toEqual([6, 2, 9]);
	});

	it("C 5 массивами", () => {
		const result = getIntersection(
			[
				0, 10, 12, 9, 5, 6, 9, 12, 9, 10, 12, 11, 11, 8, 7, 12, 12, 2,
				13, 2,
			],
			[11, 9, 12, 8, 11, 13, 2, 1, 13, 5, 3, 1, 5, 5, 14, 8, 8, 8, 9, 3],
			[13, 3, 6, 2, 1, 3, 3, 9, 10, 5, 11, 13, 8, 1, 4, 3, 1, 13, 5, 6],
			[12, 4, 9, 9, 3, 11, 5, 2, 12, 9, 5, 9, 9, 3, 13, 2, 8, 5, 4, 4],
			[
				14, 6, 12, 3, 12, 14, 4, 5, 7, 6, 10, 0, 0, 5, 10, 11, 7, 12,
				12, 3,
			]
		);

		expect(result).toEqual([5, 11]);
	});

	it("Тест на иммутабельность", () => {
		const array1 = [
			0, 10, 12, 9, 5, 6, 9, 12, 9, 10, 12, 11, 11, 8, 7, 12, 12, 2, 13,
			2,
		];

		const array2 = [
			11, 9, 12, 8, 11, 13, 2, 1, 13, 5, 3, 1, 5, 5, 14, 8, 8, 8, 9, 3,
		];

		const array3 = [
			13, 3, 6, 2, 1, 3, 3, 9, 10, 5, 11, 13, 8, 1, 4, 3, 1, 13, 5, 6,
		];

		const array4 = [
			12, 4, 9, 9, 3, 11, 5, 2, 12, 9, 5, 9, 9, 3, 13, 2, 8, 5, 4, 4,
		];

		const array5 = [
			14, 6, 12, 3, 12, 14, 4, 5, 7, 6, 10, 0, 0, 5, 10, 11, 7, 12, 12, 3,
		];

		getIntersection(array1, array2, array3, array4, array5);

		expect(array1).toEqual([
			0, 10, 12, 9, 5, 6, 9, 12, 9, 10, 12, 11, 11, 8, 7, 12, 12, 2, 13,
			2,
		]);

		expect(array2).toEqual([
			11, 9, 12, 8, 11, 13, 2, 1, 13, 5, 3, 1, 5, 5, 14, 8, 8, 8, 9, 3,
		]);

		expect(array3).toEqual([
			13, 3, 6, 2, 1, 3, 3, 9, 10, 5, 11, 13, 8, 1, 4, 3, 1, 13, 5, 6,
		]);

		expect(array4).toEqual([
			12, 4, 9, 9, 3, 11, 5, 2, 12, 9, 5, 9, 9, 3, 13, 2, 8, 5, 4, 4,
		]);

		expect(array5).toEqual([
			14, 6, 12, 3, 12, 14, 4, 5, 7, 6, 10, 0, 0, 5, 10, 11, 7, 12, 12, 3,
		]);
	});
});